app/controllers/books_controller.rb

INSERT INTO "books" ("user_id", "name", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["name", "Buku"], ["author", "salwa"], ["created_at", "2022-08-30 10:37:27.569853"], ["updated_at", "2022-08-30 10:37:27.569853"]]
---
  def create
    @book = current_user.books.build(book_params)
    if @book.save